//-----------------------------------------------------------------------------------------------
//
// ロゴ処理[logo_flash.cpp]
// Author : SHUGO KURODA
//
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------------------------
#include "logo_flash.h"
#include "manager.h"		// アプリケーション
#include "renderer.h"		// レンダリング
#include "fade.h"
#include "game.h"

#include "texture.h"

#include "camera.h"

//-----------------------------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------------------------
#define EXTEND_SPEED		(0.02f)		// アニメーションの速度

//-----------------------------------------------------------------------------------------------
// 静的メンバ変数
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------------------------
CLogoFlash::CLogoFlash() :m_anim(ANIM_NONE), m_bSceneChange(false)
{
	SetType(EObject::OBJ_LOGO);
}

//-----------------------------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------------------------
CLogoFlash::~CLogoFlash()
{
}

//-----------------------------------------------------------------------------------------------
// 生成
// const D3DXVECTOR3& pos → 生成する位置
// const D3DXVECTOR2& size → 生成するサイズ
// const char* name → 生成するテクスチャ
// const int& nCount → 破棄するまでの時間
//-----------------------------------------------------------------------------------------------
CLogoFlash* CLogoFlash::Create(const D3DXVECTOR2& size, const char* name, const int& nCount)
{
	// ポインタクラスを宣言
	CLogoFlash* pLogoExtend = new CLogoFlash;

	if (pLogoExtend != nullptr)
	{// もしnullptrではなかったら

		// サイズの保存
		pLogoExtend->SetSize(size);

		// 破棄カウンターを設定
		pLogoExtend->SetCountUninit(nCount);

		// 初期化
		pLogoExtend->Init();

		// テクスチャの設定
		pLogoExtend->BindTexture(CManager::GetManager()->GetTexture()->GetTexture(name));
	}

	return pLogoExtend;
}

//-----------------------------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------------------------
HRESULT CLogoFlash::Init()
{
	// 位置設定
	SetPosition(D3DXVECTOR3(CRenderer::SCREEN_WIDTH / 2, 500.0f, 0.0f));
	// 動き方の設定
	m_anim = ANIM_ADD;
	//初期化
	CObject2D::Init();
	// 色の設定
	SetColor(D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f));

	return S_OK;
}

//-----------------------------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------------------------
void CLogoFlash::Uninit()
{
	CObject2D::Uninit();
}

//-----------------------------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------------------------
void CLogoFlash::Update()
{
	// 動き方の設定
	Pattern();
}

//-----------------------------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------------------------
void CLogoFlash::Draw()
{
	CObject2D::Draw();
}

//-----------------------------------------------------------------------------------------------
// 動き方の設定
//-----------------------------------------------------------------------------------------------
void CLogoFlash::Pattern()
{
	// サイズの取得
	D3DXCOLOR col = GetColor();

	// 動き方の設定
	switch (m_anim)
	{
		// 縦に広がる
	case CLogoFlash::ANIM_ADD:

		// サイズの加算
		col.a += EXTEND_SPEED;
		// 指定のサイズに達したら
		if (col.a >= 1.0f)
		{
			m_anim = ANIM_SUB;
		}

		break;

		// 縦に縮む
	case CLogoFlash::ANIM_SUB:

		// サイズの加算
		col.a -= EXTEND_SPEED;
		// 指定のサイズに達したら
		if (col.a <= 0.0f)
		{
			m_anim = ANIM_ADD;
		}

		break;
	default:
		break;
	}

	// 色の設定
	SetColor(col);
}
